{
  "page_id": "index@page_id=4598",
  "filename": "index.html@page_id=4598.html",
  "title": "Portable Traffic Light Selling and Rental - Ley Choon Group Ley Choon Group",
  "full_text": "Portable Traffic Light Selling and Rental - Ley Choon Group Ley Choon Group Home About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Training Programs BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Career Contact Us × Menu Home About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Training Programs BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Career Contact Us Search Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Portable Traffic Light Selling and Rental Portable Traffic Light Selling and Rental We have affortable portable traffic lights for selling and rental. Our durable and easy-to-use temporary traffic lights ensure smooth traffic flow and worker safety in any situation. We ensure there is no sharp edges in the mounting brackets or panel casing for safety of commuters or pedestrians. The base of portable traffic light are painted in alternate orange and black colour according to the colour scheme requirement. Our portable traffic Light lens of each light are 200mm with 3-color Traffic Light, Red, Amber, Green and 2-digit display. The height can be adjustment manually. For more information and quote enquiries, please Contact Us. Traffic light Waterproof Control Box (Transmit and receive ) Battery power On / Off switch and button switch to start. (Battery not included). Timer: Adjustable timer setting by button switches (Press up or down) Timing:Traffic Light Red to Green ( Immediate) Timing: Traffic Light Green to Amber to Red adjustable timer. ( Amber change to Red staying for 3 sec only) Vehicle Clearance adjustable timer 2-digit 5\" Red LED Counter blinks for LAST 5 sec and stop at \" 00 \" with Buzzer 5mm red, amber, green LED indicator with counter 2D(88) display timer to synchronize with Traffic Light count down timer Traffic light operational test switch Input / output wire connectors Galvanised metal case with black color powder coated surface Control Box LED indicator Waterproof Control Box Front View Manual height adjustment Maximum Height Manual height adjustment Minimum Height Home | About Us | Data Privacy Policy | Our Business | Investor Relations | Career | Contact Us Copyright © 2015 Ley Choon Group Holdings Limited. UEM No.198700318G. All Rights Reserved",
  "word_count": 547
}