{
  "page_id": "index@page_id=903&paged=6",
  "filename": "index.html@page_id=903&paged=6.html",
  "title": "Newsroom - Ley Choon Group Ley Choon Group",
  "full_text": "Newsroom - Ley Choon Group Ley Choon Group Home About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Training Programs BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Career Contact Us × Menu Home About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Training Programs BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Career Contact Us Search Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Newsroom View : All Year : All All Releases Notice of AGM FY23 July 13, 2023 Read more Proxy Form for AGM FY23 July 13, 2023 Read more Full Year FY23 May 29, 2023 Read more Ley Choon Results 2HFY23 Press Release May 29, 2023 Read more Award of Contracts February 6, 2023 Read more First Half FY23 January 11, 2023 Read more Registration of Ley Choon Gim Tian Joint Venture LLP December 30, 2022 Read more Asset Acquisitions and Disposals December 30, 2022 Read more Disclosure of Interest of Zheng Choon Holdings Pte. Ltd. and its Shareholders December 13, 2022 Read more Disclosure of Interest of Mr Toh Choo Huat December 13, 2022 Read more Page 6 of 61« First«...45678...20...»Last » Home | About Us | Data Privacy Policy | Our Business | Investor Relations | Career | Contact Us Copyright © 2015 Ley Choon Group Holdings Limited. UEM No.198700318G. All Rights Reserved",
  "word_count": 412
}