{
  "page_id": "index@page_id=903&paged=9",
  "filename": "index.html@page_id=903&paged=9.html",
  "title": "Newsroom - Ley Choon Group Ley Choon Group",
  "full_text": "Newsroom - Ley Choon Group Ley Choon Group Home About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Training Programs BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Career Contact Us × Menu Home About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Training Programs BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Career Contact Us Search Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Newsroom View : All Year : All All Releases Minutes of Extraordinary General Meeting Held on 25 March 2022 April 8, 2022 Read more Disclosure of interest – Hiap Hoe Investment Pte. Ltd. and Hiap Hoe Limited March 29, 2022 Read more Disclosure of interest – Zheng Choon Holdings Pte. Ltd. and its Shareholders March 29, 2022 Read more Disclosure of Interest of Mr Toh Choo Huat March 29, 2022 Read more Equity Listing - Ordinary Shares March 29, 2022 Read more Extraordinary/ Special General Meeting Notice of EGM 2022 Proxy Form 2022 Important Notice of EGM EGM Circular 2022 Results of EGM 25-March-2022 March 25, 2022 Read more General Announcement March 22, 2022 Read more Circular - EGM March 10, 2022 Read more Proxy Form for EGM FY22 March 10, 2022 Read more Notice of EGM FY22 March 10, 2022 Read more Page 9 of 61« First«...7891011...20...»Last » Home | About Us | Data Privacy Policy | Our Business | Investor Relations | Career | Contact Us Copyright © 2015 Ley Choon Group Holdings Limited. UEM No.198700318G. All Rights Reserved",
  "word_count": 439
}