{
  "page_id": "index@page_id=3216",
  "filename": "index.html@page_id=3216.html",
  "title": "Course Fees & Registration - ATTC - Ley Choon Group Ley Choon Group",
  "full_text": "Course Fees & Registration - ATTC - Ley Choon Group Ley Choon Group Home About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Training Programs BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Career Contact Us × Menu Home About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Training Programs BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Career Contact Us Search BCA ATTC BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Course Fees & Registration Ley Choon is a BCA Approved Training and Testing Centre (ATTC). We provide training and skills assessments for construction workers and our experienced trainers are always on hand to address the needs of each and every candidate. We provide : Hydraulic Excavator Operation(As Lifting Machine) Bulldozer Operator Course Construction Plant Operation (non-lifting) CET Online Core Trade /ALP /SEC(K) Trade Course Type Skill Level Duration (8 hours per day) Course Fees (Exlc. GST) Practical Theory Test Hydraulic Excavator Operation(As Lifting Machine) Familiarization Course CoreTrade & SEC (K) 1 day 1 day 1 day $1,600.00 Full course 5 days 1 day 1 day $1,900.00 Retest 0.5 day 0.5 day 1 day $390.00 Accelerated Learning Programme ALP 1 day - 0.5 day $1,410.00 Bulldozer Operation Familiarization Course CoreTrade & SEC (K) 1 day 1 day 1 day $1,410.00 Full course 5 days 1 day 1 day $2,710.00 Retest 0.5 day 0.5 day 1 day $830.00 Accelerated Learning Programme ALP 1 day - 0.5 day $1,410.00 Bulldozer Operation (SCDF PERSONNEL ONLY) Familiarization Course SEC (K) 2 days 1 day 1 day $2,200.00 Full course 7 days 1 day 1 day $3,500.00 Retest 1 day 1 day 1 day $1,030.00 *Additional Course Training Requests: $200 (excl.GST) per day. Applicants are required to make payments exclusively to the company's designated bank account and obtain an official receipt. For course application and details of the registration process, please download the application form here. For queries on application, please contact: Training Coordinator Tel: 6705 5290 / 9749 7241 Email: training@leychoon.com Theoretical Lessons Practical Lessons Practical Test conducted by BCA Marking & Pegging Bulldozer Excavator Operation Excavator Operation Lifting Lesson Home | About Us | Data Privacy Policy | Our Business | Investor Relations | Career | Contact Us Copyright © 2015 Ley Choon Group Holdings Limited. UEM No.198700318G. All Rights Reserved",
  "word_count": 574
}