{
  "page_id": "index@page_id=2",
  "filename": "index.html@page_id=2.html",
  "title": "About Us - Ley Choon Group Ley Choon Group",
  "full_text": "About Us - Ley Choon Group Ley Choon Group Home About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Training Programs BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Career Contact Us × Menu Home About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Training Programs BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Career Contact Us Search About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Corporate Profile Ley Choon Group Holdings Limited (“Ley Choon” or the “Group”) is an established one-stop underground utilities infrastructure construction and road works service provider. Since our inception as Ley Choon Constructions and Engineering Pte Ltd in 1990, we have grown our spectrum of services to encompass: 1) Underground utilities infrastructure construction and maintenance services, which include water pipes, NEWater pipes, high-pressure gas pipes, high-voltage power cables, fibre optic cables and sewer pipeline rehabilitation; 2) Road and airfield pavement construction and maintenance services, which include the supplying and laying of graded stones, cement treated base and milling and laying of asphalt premix; and 3) Construction materials supply services, which include production of asphalt premix and recycled aggregates from construction and demolition waste and production of ready mix concrete and cement bricks. As a one-stop underground utilities infrastructure construction service provider, our core strengths reside with our technical expertise in underground utilities infrastructure and the in-house supply of construction materials such as asphalt premix and recycled aggregates. Ley Choon is one of the few asphalt plant operators in Singapore. Our asphalt plant is one of the largest in Singapore with production capacity of up to 400 tonnes per hour. The built-in recycling feature and the offering of various asphalt premix formulations to meet customer requirements provide us with a competitive advantage. Our customers include Singapore government agencies such as Public Utilities Board (“PUB”) and Land Transport Authority (“LTA”), as well as reputable companies such as Changi Airport Group and SP Group. As a L6-registered contractor (the highest grade) with the Building and Construction Authority (“BCA”), Ley Choon can tender for Singapore’s public sector contracts of unlimited value in the categories of cable/pipe-laying and road reinstatement, essential construction materials and other basic construction materials. The Group is also an A1-registered contractor in the category of civil engineering (CWO2). Leveraging on our expertise, the Group has been expanding overseas. The Group set up its first plant in China, engaging in the construction waste recycling and the development, production and sale of eco-green construction materials. Currently, the Group is undertaking a sewer pipeline rehabilitation project funded by Asian Development Bank (ADB) in Sri Lanka, and has since secured and completed a second project in FY2019. Headquartered in Singapore with headcount of around 1000, we build our technology capabilities by investing in people, process and system optimization, such as the application of Enterprise Resource Planning (ERP) system and mobile CCTV monitoring system. As a testament to our technological advantage and service quality, Ley Choon has been accredited with IMS-ISO 9001, BS-OHSAS 18001, ISO 14001 and Green And Gracious Builder Award. Ley Choon was listed on the Main Board of Singapore Exchange Securities Trading Limited (“SGX-ST”) in August 2012 via a reverse takeover of Ultro Technologies Limited and transferred to the Catalist Board on 22 February 2017. DOWNLOAD CORPORATE BROCHURE HERE Home | About Us | Data Privacy Policy | Our Business | Investor Relations | Career | Contact Us Copyright © 2015 Ley Choon Group Holdings Limited. UEM No.198700318G. All Rights Reserved",
  "word_count": 762
}