{
  "page_id": "index@page_id=2467",
  "filename": "index.html@page_id=2467.html",
  "title": "Board of Directors - Ley Choon Group Ley Choon Group",
  "full_text": "Board of Directors - Ley Choon Group Ley Choon Group Home About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Training Programs BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Career Contact Us × Menu Home About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Training Programs BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Career Contact Us Search Corporate Governance Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Board of Directors Mr Toh Choo Huat Executive Chairman and Chief Executive Officer Mr Toh Choo Huat is the Executive Chairman and Chief Executive Officer of Ley Choon Group Holdings Limited (“Ley Choon” or the “Group”). As one of the Group’s founders, Mr Toh has played a pivotal role in the growth and development of the Group. He is responsible for the overall business development and general management of the Group. He also oversees the overall strategic directions and expansion plans for the growth and development of the Group. Mr Toh has more than 20 years of experience in the business of Underground Utilities Infrastructure construction and maintenance, sewer pipeline rehabilitation, road and airfield construction and maintenance. Prior to the establishment of Ley Choon, Mr Toh worked as a maintenance technician in Fairchild Semiconductor Pte Ltd. In 1990, Mr Toh and his brothers incorporated Ley Choon Constructions and Engineering Pte Ltd (“LCCE”). Mr Toh holds a Diploma in Electrical & Electronic from Ngee Ann Technical College (in association with Central Polytechnic London). Mr Ragavendran Srinivasan Executive Director, Chief Financial Officer & Dy. Chief Executive Officer Mr.R.Srinivasan has been appointed as Chief Financial Officer in Jan 2021, responsible for accounting, financial reporting, treasury, management accounting, corporate compliance, taxation and other related matters of the Group. Mr.R.Srinivasan joined the Group in 2012 as Senior Assistant Financial Controller and he was subsequently promoted as Group Financial Controller in 2016. Prior to joining the Group, he was the Group Finance Manager of Ultro Technologies Ltd, which was taken over by Ley Choon Group in 2012 through Reverse Take Over, since 1997. He has 25 years of diverse experience in accounting & finance which includes 15 years of experience in managerial and controller roles in financial reporting, corporate affairs & compliance, management accounting and tax planning in electronics components distribution, manufacturing, coal mining and construction industries. Mr.Srinivasan graduated with a Bachelor of Commerce degree and is a Chartered Accountant of Singapore with the Institute of Singapore Chartered Accountants. He is also a Fellow of the Association of Chartered Certified Accountants, UK. Ms Reanne Toh Ting Xuan Executive Director, Head-Tender, Contracts & Sales Ms Reanne Toh is responsible for the overall execution of the contracts, driving sales revenue and formulating business/tender strategies of the Group where she is adept in building connections in the industry as well as managing clientele/supplier relationships. Prior to this role, she oversaw the project management function of the Group which ensures projects are delivered on time, within budget and complies to the best safety and health standards. Before joining the Group, she worked as an Estimator in Melbourne, Australia and has since grown to love the challenges of adeptly developing and understanding market trends and intuitions on top of having to learn industry trade skills, and thereafter competitively bidding for contracts and successfully lands in project execution. Ms Reanne Toh obtained her Bachelor in Property & Construction from the University of Melbourne in Australia, and is an Associate Member of the Singapore Institute of Arbitrators (ASIArb). She is also a member of the Singapore Institute of Directors (SID). Mr William Tan Kwang Hwee Lead Independent Director William is Group CFO of SGX Mainboard-listed Tiong Woon Corporation Holding (SGX: BQM), and presently serves as member of the ACCA Singapore Member Network Panel. An MBA, qualified accountant and engineer by training, he was named Executive of the Year – Construction & Materials at the Singapore Business Review Management Excellence Awards 2016, for his role in the successful S$120m corporate restructuring exercise of a SGX- ListCo. William possesses strong working knowledge of SGX Listing Requirements and Corporate Governance, having served as CFO in 4 SGX-listed groups in his 20 years of experience in SGX-listed manufacturing & precision engineering, construction & materials, heavy lift & haulage, marine transportation, equipment leasing & logistics, venture capital, private equity & property investments, leisure & hospitality, food & beverage environments, with diverse roles including full finance spectrum, corporate affairs, operations management, HR & administration, as well as Big Four audit experience spanning multi-industries. Beginning his career in Liang Huat Aluminium (erstwhile SGX: 1C5), his previous roles include CFO of EnGro Corporation (SGX: S44), Assistant Vice President, Finance - Casino Accounting & Credit of Resorts World Sentosa (SGX: G13), CFO of Ley Choon Group Holdings (SGX: Q0X), CFO of Metal Component Engineering (SGX: 5DX) and auditor with KPMG. A Chartered Accountant of Singapore and Fellow of the Association of Chartered Certified Accountants (ACCA), UK, William graduated with Honours with a Bachelor of Engineering (Mechanical) from National University of Singapore, holds a Bachelor of Science in Applied Accounting (First Class Honours) from Oxford Brookes University, UK and obtained his MBA from Manchester Business School, UK. He was also an ACCA Prize Winner and Top 30 Affiliate, and served as member of ACCA Singapore’s SME Finance Transformation Sub- Committee. Mr Buhdy Bok Sin Swee Independent Director Mr. Buhdy Bok is a seasoned leader with over 25 years of experience in the travel and tourism industry, spanning various sectors such as airlines, cruise lines, and attractions across Asia. He has held several key leadership positions throughout his career, significantly contributing to the growth and success of each organization he has been a part of. Since 2018, Mr. Bok has served as the Managing Director of Mount Faber Leisure Group Pte. Ltd., one of Singapore's largest attraction companies. In this role, he has been responsible for overseeing the company's overall operations and steering it through a period of transformation and growth. Prior to his current role, Mr. Bok held several senior leadership positions in the travel and tourism industry. He served as Chief Commercial Officer at NokScoot Airlines, President of Carnival Asia at Carnival Corporation & PLC, and President of Costa Group Asia at Costa Crociere S.p.A., overseeing operations across Asia. Earlier in his career, he spent 15 years at Singapore Airlines, working in various roles from Finance to Planning, with overseas postings in China and Italy. Mr. Bok's contributions to the industry have been recognized, including the Magnolia Silver Award in 2016 by the Shanghai Municipal People’s Government for his contributions to Shanghai’s economic construction, social development and international exchange. He holds a Bachelor’s degree in Accountancy from Nanyang Technological University, a Bachelor’s degree in Law from the University of London, and an MBA from Duke University’s Fuqua School of Business in the USA. He brings extensive expertise and leadership experience to the board, contributing to the organization's strategic direction and governance. Mr Chua Hock Thak Independent Director Mr Chua Hock Thak was appointed as Independent Director of the Company on 2 Apr 18. He is also the Chairman of Nomination Committee and member of the Audit and Remuneration Committee. Mr Chua has some 40 years of experience in the development of water infrastructure projects. He was with PUB, Singapore's National Water Agency, for 34 years holding various positions and was involved in the development of water infrastructures such as water and NEWater treatment works, water transmission and distribution pipelines, raw water and treated water reservoirs and barrage structures for raw water intakes. Prior to that, He was with JKR Kelantan for 2 years and contractors for 4 years, during which he was involved in the development of rural water supply scheme in Kelantan. Mr Teo Ho Beng Non-Executive Director Mr Teo Ho Beng is presently the Executive Chairman and Chief Executive Officer of Hiap Hoe Group. Mr Teo has more than 38 years of experience in the construction and property industries, and over 23 years of experience in the leisure industry. Mr Teo is responsible for the formulation of corporate strategies and policies for Hiap Hoe, and ensures their implementation by senior management at the operations level. Mr Teo also chairs the senior management meetings to monitor Hiap Hoe’s performance, and oversees management, budgeting and forecasting procedures to ensure there is prudent financial management. Home | About Us | Data Privacy Policy | Our Business | Investor Relations | Career | Contact Us Copyright © 2015 Ley Choon Group Holdings Limited. UEM No.198700318G. All Rights Reserved",
  "word_count": 1604
}