{
  "page_id": "index@page_id=3823",
  "filename": "index.html@page_id=3823.html",
  "title": "Bulldozer Operation Course - ATTC - Ley Choon Group Ley Choon Group",
  "full_text": "Bulldozer Operation Course - ATTC - Ley Choon Group Ley Choon Group Home About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Training Programs BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Career Contact Us × Menu Home About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Training Programs BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Career Contact Us Search BCA ATTC BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Bulldozer Operation The Bulldozer Operation course aims to equip trainees with the knowledge and skills required to meet the standards required of the test level. General knowledge of the bulldozer Daily inspection and weekly maintenance of the bulldozer Pre-start and shut-down procedures Manoeuvre and park the plant through the bulldozer test circuit and park the plant in designated positions Mark out the boundary of the trench according to the drawing Good practices for backfilling, travelling and loading excavated materials onto vehicles Post operation procedure Please refer to Course Fees & Registration for more details on the bulldozer operator course fees, duration and registration. Applicants are required to make payments exclusively to the company's designated bank account and obtain an official receipt. Home | About Us | Data Privacy Policy | Our Business | Investor Relations | Career | Contact Us Copyright © 2015 Ley Choon Group Holdings Limited. UEM No.198700318G. All Rights Reserved",
  "word_count": 419
}