{
  "page_id": "index@page_id=24",
  "filename": "index.html@page_id=24.html",
  "title": "Underground Pipes and Roads & Repairs - Ley Choon Group Ley Choon Group",
  "full_text": "Underground Pipes and Roads & Repairs - Ley Choon Group Ley Choon Group Home About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Training Programs BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Career Contact Us × Menu Home About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Training Programs BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Career Contact Us Search Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Portable Traffic Light Selling and Rental Pipes and Roads Since 1990, Ley Choon has undertaken and completed a wide range of Underground Utilities Infrastructure works and repairs for corporations such as: Public Utilities Board (PUB) PowerGas Singtel Jurong Town Corporation (JTC) Land Transport Authority (LTA), and more In Singapore, underground utilities like water, gas and sewer pipeline works require specific expertise and specialised equipment for work. We are one of the few companies in Singapore that is well equipped with a wide-ranging in-house expertise, specialised equipment and an expansive range of materials in varying sizes and/or pressure specifications to effectively perform such services. Utility service Diversion and/or Urgent Repair Works (Pipelines and Cables) Specifications Underground Water Pipeline (Potable/NEWater) 15 mm to 2.2 m (⌀) Pressurized Gas Pipeline 50mm (low pressure polyethylene pipes) to 600mm (high pressure steel pipes) Sewer Pipeline (Trenchless Technology) 110 mm to 3 m (⌀) High Voltage Power cables Up to 66KV (high tension electricity cable) For more information and quote enquiries, please Contact Us. Home | About Us | Data Privacy Policy | Our Business | Investor Relations | Career | Contact Us Copyright © 2015 Ley Choon Group Holdings Limited. UEM No.198700318G. All Rights Reserved",
  "word_count": 461
}