{
  "page_id": "index@page_id=332",
  "filename": "index.html@page_id=332.html",
  "title": "Asphalt Premix, Milling & Paving Works, Road Marking - Ley Choon Group Ley Choon Group",
  "full_text": "Asphalt Premix, Milling & Paving Works, Road Marking - Ley Choon Group Ley Choon Group Home About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Training Programs BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Career Contact Us × Menu Home About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Training Programs BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Career Contact Us Search Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Portable Traffic Light Selling and Rental Asphalt Premix, Milling & Paving Works, Road Marking The use of asphalt premix is paramount to the construction and maintenance of the roads and airfields in Singapore. Ley Choon Group also undertakes the business of construction, extension and maintenance services for roads, airfield taxiways and aprons. We have undertaken airfield resurfacing work at Changi Airport and airfield taxiway and aprons construction at Seletar Airport. We also have a dedicated road marking team to meet your road marking needs. As one of only four asphalt premix plant operators in Singapore, the Group’s plant is capable of asphaltic production for different premix formulations in accordance to customer’s specifications. Production Capacity : Based on customer's specification: Up to 400 metric ton per hour Silo storage for finished products: Up to 1000 metric ton Sustainability also plays a huge role in Ley Choon Group, with green initiatives like : Asphalt premix plant operates on natural gas (an environmentally-friendly fuel choice) The plant incorporates built-in recycling features to recycle milled waste and used asphalt pavement Construction waste recycling plant produces recycled aggregates for re-use as backfilling materials. For more information on the type of asphalt premixes, milling and paving works, please Contact Us. Home | About Us | Data Privacy Policy | Our Business | Investor Relations | Career | Contact Us Copyright © 2015 Ley Choon Group Holdings Limited. UEM No.198700318G. All Rights Reserved",
  "word_count": 499
}