{
  "page_id": "index@page_id=3210",
  "filename": "index.html@page_id=3210.html",
  "title": "Hydraulic Excavator Operation (As Lifting Machine) - ATTC - Ley Choon Group Ley Choon Group",
  "full_text": "Hydraulic Excavator Operation (As Lifting Machine) - ATTC - Ley Choon Group Ley Choon Group Home About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Training Programs BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Career Contact Us × Menu Home About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Training Programs BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Career Contact Us Search BCA ATTC BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Hydraulic Excavator Operation (As Lifting Machine) Welcome to the Hydraulic Excavator Operations (As Lifting Machine) Training course. This program is conducted by Ley Choon Construction & Engineering Pte Ltd BCA Approved Training and Testing Centre. The 6 key learning outcomes and associated content are set out below: PS1: Distinguish the various hydraulic excavator models commonly employed in the construction sector. PS2: Recognize the key elements comprising a hydraulic excavator. PS3: Describe the purposes of safety mechanisms and indicators installed on the hydraulic excavator. PS4: Execute the prescribed manual signals and communication methods for operating a hydraulic excavator. PS5: Adhere to proper operational protocols and safety measures. PS6: Analyze Lifting Plans and undertake necessary preparations before engaging in lifting activities. PS7: Review the load indicator monitor and understand warning signs for effective interpretation. Please refer to Course Fees & Registration for more details on the excavator operator course fees, duration and registration. Applicants are required to make payments exclusively to the company's designated bank account and obtain an official receipt. Home | About Us | Data Privacy Policy | Our Business | Investor Relations | Career | Contact Us Copyright © 2015 Ley Choon Group Holdings Limited. UEM No.198700318G. All Rights Reserved",
  "word_count": 470
}