{
  "page_id": "page_18",
  "filename": "index.html@p=18.html",
  "title": "Career - Ley Choon Group Ley Choon Group",
  "full_text": "Career - Ley Choon Group Ley Choon Group Home About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Training Programs BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Career Contact Us × Menu Home About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Training Programs BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Career Contact Us Search Career Join Ley Choon Group and be part of a team that drives progress. We’re seeking passionate, driven individuals ready to grow, make an impact, and build a brighter tomorrow, together. The following are the available positions for job openings. Click \"View / Apply\" for the jobs that interest you. Alternatively, you can submit a general application through the link below. Thank you. Home | About Us | Data Privacy Policy | Our Business | Investor Relations | Career | Contact Us Copyright © 2015 Ley Choon Group Holdings Limited. UEM No.198700318G. All Rights Reserved",
  "word_count": 326
}