{
  "page_id": "page_4893",
  "filename": "index.html@p=4893.html",
  "title": "BCA ATTC - Ley Choon Group Ley Choon Group",
  "full_text": "BCA ATTC - Ley Choon Group Ley Choon Group Home About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Training Programs BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Career Contact Us × Menu Home About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Training Programs BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Career Contact Us Search Training Programs BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program BCA ATTC Ley Choon is a BCA Approved Training and Testing Centre (ATTC) incorporated in May 2011. We provide training and tests (skills assessments) for construction workers as a platform to equip them with the knowledge and practical skills to operate the hydraulic excavator and bulldozer machines. Our experienced trainers are always on hand to address the needs of each and every candidate. With patience and dedication, they will help candidates meet the objectives to achieve good results. For more information on the upgrading pathways, please refer to BCA website here and MOM website here. We offer courses in the following trades: Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation The various skill levels or programmes available are: CoreTrade Skills Assessment Skills Evaluation Certificate (Knowledge) Continuing Education and Training (CET) Accelerated Learning Programme (ALP) 1. CoreTrade Skills Assessment The CoreTrade Scheme was created to develop a pool of competent and experienced tradesmen to raise quality and productivity in the built environment sector. 2. Skills Evaluation Certificate (SEC / SEC (K)) The Skills Evaluation Certificate (Knowledge), or SEC(K), aims to raise skills, productivity, and safety standards in the construction industry. It is one of the most direct routes for upgrading to Higher-Skilled (R1) status under MOM’s levy scheme. 3. Accelerated Learning Programme (ALP) The Accelerated Learning Programme (ALP) provides an express route for experienced workers to achieve higher-skilled status through a 1-day training course and a practical skills validation (4–5 hours) conducted at a BCA ATTC. More info: https://www1.bca.gov.sg/buildsg/manpower/bca-approved-training-and-testing-centres Home | About Us | Data Privacy Policy | Our Business | Investor Relations | Career | Contact Us Copyright © 2015 Ley Choon Group Holdings Limited. UEM No.198700318G. All Rights Reserved",
  "word_count": 543
}