{
  "page_id": "page_3827",
  "filename": "index.html@p=3827.html",
  "title": "Construction Plant Operation (non-lifting) CET Online - Ley Choon Group Ley Choon Group",
  "full_text": "Construction Plant Operation (non-lifting) CET Online - Ley Choon Group Ley Choon Group Home About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Training Programs BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Career Contact Us × Menu Home About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Training Programs BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Career Contact Us Search BCA ATTC BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Construction Plant Operation (non-lifting) CET Online We are one of the ATTC providing online CET training for Construction Plant Operation (non-lifting). In order to continuously upgrade the construction workforce to support improvements in productivity, quality and safety, all CoreTrade personnel are required to attend CET courses under their respective registered trade category for CoreTrade renewal. The CET in Construction Plant Operation Training (non-lifting) is a half-day course covering the latest codes and regulations, good practices in non-lifting operation and new technology in non-lifting machines. Participants will also be introduced to new hazards in non-lifting operation and latest case studies of lifting accidents. CET FEES Construction Plant Operation (non-lifting) – $ 110.00 (Exclude GST). Applicants are required to make payments exclusively to the company's designated bank account and obtain an official receipt. For course application and details of the registration process, please download the application form here. For queries on application, please contact: Training Coordinator Tel: 6705 5290 / 9749 7241 Email: training@leychoon.com Home | About Us | Data Privacy Policy | Our Business | Investor Relations | Career | Contact Us Copyright © 2015 Ley Choon Group Holdings Limited. UEM No.198700318G. All Rights Reserved",
  "word_count": 461
}