{
  "page_id": "page_289",
  "filename": "index.html@p=289.html",
  "title": "Management Team - Ley Choon Group Ley Choon Group",
  "full_text": "Management Team - Ley Choon Group Ley Choon Group Home About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Training Programs BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Career Contact Us × Menu Home About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Training Programs BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Career Contact Us Search About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Management Team Mr Toh Chew Leong Advisor Mr Toh Chew Leong is the Advisor of Ley Choon and is one of the founders of the Group. Mr Toh oversees the Group’s asphalt premix plant and construction waste recycling plant and assists in the day to day operations of the Group’s business in sewer pipeline rehabilitation and road resurfacing. Mr Toh Swee Kim Advisor Mr Toh Swee Kim is the Advisor of Ley Choon. He oversees all operations for its Underground Utilities Infrastructure construction and maintenance business, including deployment of resources, purchasing, equipment maintenance, and manpower and operations management of the Group. Mr Toh has an extensive experience of more than 20 years in the Group’s pipe and cable laying business. In the 1990s, Mr Toh joined Ley Choon Construction Engineering Co, the predecessor of LCCE, as an operations manager and he has been responsible for overseeing the day to day operations of the pipe laying and cable laying business. Mr Toh Chew Chai Advisor Mr Toh Chew Chai joined Ley Choon Group since its establishment. As the Group’s Advisor, he oversees all operations for Underground Utilities Infrastructure construction and maintenance business, including deployment of resources, purchasing, equipment maintenance, and manpower and operations management of the Group. Mr Toh has extensive experience of more than 20 years in the Group’s business in pipes and cable laying. In 1990, Mr Toh joined Ley Choon Construction Engineering Co, the predecessor of LCCE, as an operations manager. Mr Zhang Wei Qiang Chief Operating Officer Mr Zhang Wei Qiang joined Ley Choon Group as a Project Manager in 2019 and has since taken on leadership roles across multiple key departments, including the Small Diameter Pipe Division, Gas Division, Fleet Department, Asphalt Plant, Milling & Patching Department, and the Group’s Environment, Health & Safety function. In April 2022, he was appointed General Manager for Sri Lanka at the height of the country’s national economic crisis and recession, where he played a pivotal role in navigating operational challenges. Before joining Ley Choon, Mr Zhang served as a Project Manager at a well-established construction firm in Singapore for several years, where he managed both construction and coal mining operations across Singapore and the wider Asia region. His broad experience in operations and support functions has been instrumental in restructuring Ley Choon’s Supply Chain and establishing an Asset Management function, including the direct import of pipes and fittings from China under the Ley Choon brand. Mr Zhang holds a Bachelor’s Degree in Civil Engineering from China University of Mining and Technology (CUMT, 中国矿业大学), awarded in 2010. He went on to earn a Master’s Degree in Applied Project Management from the University of Adelaide in 2016, and most recently completed the Global Master of Business Administration (GMBA) program at Alliance Manchester Business School in December 2024. Dr Ou Zhiyong Head (Project Management Office, Big Pipe & Road Works) Dr Ou Zhiyong has been appointed as the Head of Project Management Office, Big Pipe & Road Works Division in 2024, responsible for tendering of projects and overseeing all project executions, which includes big pipe and road work projects. Dr Ou joined the Group in 2020 as Senior Project Manager. Prior to joining Ley Choon Group, Dr Ou worked as a consultant in the engineering field for 5 years and then as a manager for property developer for 3 years. Dr Ou holds a Bachelor degree and a PhD degree from the National University of Singapore in Civil Engineering. Mr Toh Kai Hock IT Director & Head of Fleet Department Mr Toh Kai Hock joined the Group as IT Manager in 2011. His areas of responsibilities include all informational technology related matters and fleet management of the organisation. Mr Toh graduated with a Bachelor of Engineering (Electrical Engineering) First Class Honours from National University of Singapore (NUS). Mr Toh Kai Sheng, Adam Director, Operations & HR Mr Toh Kai Sheng, Adam joined the Group in 2009 as management executive, and has since worked under various departments within the group, including operations, finance, logistics, training centre and property development. He oversees Group HR and Administration, and assist the CEO/COO in overseeing Operation functions of the Group. Mr Toh graduated from the Nanyang Technological University of Singapore with a Bachelor of Accountancy with First Class Honours and second specialisation in Banking and Finance. He also holds a Diploma in Management Accounting from Chartered Institute of Management Accountants, and is a Chartered Accountant of Singapore. Home | About Us | Data Privacy Policy | Our Business | Investor Relations | Career | Contact Us Copyright © 2015 Ley Choon Group Holdings Limited. UEM No.198700318G. All Rights Reserved",
  "word_count": 1027
}