{
  "page_id": "page_4904",
  "filename": "index.html@p=4904.html",
  "title": "Essential Road Maintenance Training Program - Ley Choon Group Ley Choon Group",
  "full_text": "Essential Road Maintenance Training Program - Ley Choon Group Ley Choon Group Home About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Training Programs BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Career Contact Us × Menu Home About Us Corporate Profile Corporate Video Vision and Mission History & Milestones Our Group Structure Board of Directors Management Team Awards & Certifications Our Business Pipes and Roads Asphalt Premix, Milling & Paving Works, Road Marking Project Track Record Our Customers Our Offices & Facilities Our Competitive Strengths Investor Relations Newsroom Announcements Press Releases Corporate Governance Board of Directors Management Team Financial Information Annual Reports and Circulars Financial Results Sustainability Report Research Reports IR Contact Training Programs BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Career Contact Us Search Ley Choon Training Courses BCA ATTC Course Fees & Registration Hydraulic Excavator Operation (As Lifting Machine) Bulldozer Operation Construction Plant Operation (non-lifting) CET Online Ley Choon Training Courses Essential Road Maintenance Training Program Essential Road Maintenance Training Program Introducing the Essential Road Maintenance Training Program. This program is conducted by Ley Choon Construction & Engineering Pte Ltd. The Essential Road Maintenance Training Program is designed to equip participants with comprehensive knowledge and practical skills essential for executing road maintenance works safely and efficiently. This program blends theoretical instruction with hands-on practice to prepare participants for real-world challenges in road construction and maintenance. The course structure ensures a balanced understanding of pavement structures, road maintenance machinery, safety protocols, and regulatory requirements. Course Objectives: By the end of the program, participants will be able to: •LO1: Comply with LTA Code of Practice for Traffic Control at Work Zones and Workplace Safety and Health (WSH) regulations during road maintenance operations. •LO2: Apply road safety protocols and correctly use Personal Protective Equipment (PPE) to ensure a safe work environment. •LO3: Interpret Traffic Control Plans (TCPs) and implement traffic control measures in compliance with approved procedures and site-specific conditions. •LO4: Perform pavement maintenance tasks, including defects identification, patching, and resurfacing, based on road condition assessments. •LO5: Operate and maintain road maintenance machinery and equipment safely and in accordance with operational guidelines. •LO6: Apply excavation safety measures and soil stabilization techniques to prevent trench collapse and ensure ground stability. Course Duration (8 hours per day) Course Fees (Exclude GST) Practical Theory Test Essential Road Maintenance 4 Days 1 Day 1 Day $ 2,700 *Additional Course Training Requests: $200 (Exclude GST) per day. Applicants are required to make payments exclusively to the company's designated bank account and obtain an official receipt. For queries on application, please contact: Training Coordinator Tel: 6705 5290 / 9749 7241 Email: training@leychoon.com Home | About Us | Data Privacy Policy | Our Business | Investor Relations | Career | Contact Us Copyright © 2015 Ley Choon Group Holdings Limited. UEM No.198700318G. All Rights Reserved",
  "word_count": 577
}