{
  "page_id": "business",
  "filename": "business.html",
  "title": "Our Business - Ley Choon Group",
  "full_text": "Our Business - Ley Choon Group Home About Us Our Business Investor Relations Training Programs Career Contact Us English 中文 Melayu தமிழ் Our Business Underground Utilities Infrastructure, Road & Airfield Construction, and Construction Materials Overview Pipes & Roads Asphalt & Paving Project Track Record Our Customers Offices & Facilities Competitive Strengths Traffic Lights Business Overview Ley Choon Group Holdings Limited (\"Ley Choon\" or the \"Group\") is one of the largest Underground Utilities Infrastructure companies in Singapore focusing on the following two key business segments: 🔧 Underground Utilities Infrastructure Underground Utilities Infrastructure construction and maintenance, sewer pipeline rehabilitation, laying of high voltage transmission power cable and high pressure transmission LNG GAS pipeline. 🛣️ Asphalt Premix, Milling & Paving Works Asphalt pre-mix production, sales and construction waste recycling as well as road and airfield construction and maintenance. Pipes and Roads Since 1990, Ley Choon has undertaken and completed a wide range of Underground Utilities Infrastructure works and repairs for corporations such as: Public Utilities Board (PUB) Jurong Town Corporation (JTC) Land Transport Authority (LTA) And more... In Singapore, underground utilities like water, gas and sewer pipeline works require specific expertise and specialised equipment for work. We are one of the few companies in Singapore that is well equipped with a wide-ranging in-house expertise, specialised equipment and an expansive range of materials in varying sizes and/or pressure specifications to effectively perform such services. Our Services Utility Diversion & Urgent Repairs Pipelines and Cables Underground Water Pipeline Potable/NEWater Pressurized Gas Pipeline 50mm (low pressure) to 600mm (high pressure steel pipes) Sewer Pipeline Trenchless Technology High Voltage Power Cables Up to 66KV (high tension electricity cable) For more information and quote enquiries, please Contact Us Asphalt Premix, Milling & Paving Works, Road Marking The use of asphalt premix is paramount to the construction and maintenance of the roads and airfields in Singapore. Ley Choon Group also undertakes the business of construction, extension and maintenance services for roads, airfield taxiways and aprons. We have undertaken airfield resurfacing work at Changi Airport and airfield taxiway and aprons construction at Seletar Airport. We also have a dedicated road marking team to meet your road marking needs. 🏭 Our Asphalt Plant As one of only four asphalt premix plant operators in Singapore, the Group's plant is capable of asphaltic production for different premix formulations in accordance to customer's specifications. Production Capacity: Up to 400 metric ton per hour Silo Storage: Up to 1000 metric ton for finished products Sustainability Initiatives 🌱 Asphalt premix plant operates on natural gas (an environmentally-friendly fuel choice) ♻️ The plant incorporates built-in recycling features to recycle milled waste and used asphalt pavement 🏗️ Construction waste recycling plant produces recycled aggregates for re-use as backfilling materials For more information on the type of asphalt premixes, milling and paving works, please Contact Us Project Track Record Potable Water / NEWater Mains Supply, Laying & Diversion of 100-1800mm Dia Ductile Iron and/or Steel Watermains for North & West Areas Supply and Laying of Watermains in West Division Watermain Repairs and Other Contract Work for Network Services (West/East) Division Supply and Laying of NEWater and Industrial Watermains Supply and Installation of Water Connection Works Maintenance and Servicing of Installations in Water Supply (Network) Replacement and Network Enhancement of Watermains Term Contract for Maintenance and Repair Works to Water and Hydrant Mains Systems at Singapore Changi Airport Steel Mains / Sewer Pipelines & Rehabilitation Rehabilitation of Selected 10km of Sewer Lines and Condition Assessment of 125km in Colombo Municipal Council Area Supply, Laying and Installation of 900mm Diameter Water Pipeline along Buangkok Green and Sengkang East Road Proposed Twin 1600mm Diameter Pipeline from AYE/Henderson Road to Keppel Road Proposed 2200mm Diameter Pipeline from Murnane Service Reservoir to PIE/Rifle Range Road Rehabilitation of Sewerage Network Phase 5 – CCTV Survey of Sewers (Eastern Region) Power Cables & Gas Pipelines Supply and Installation of 66kV Power Cables, Auxiliary Cables and Accessories Supply and Installation of 230kV Power Cables and 66kV Power Cables Cable Installation, Cable Jointing and Road Reinstatement Works for Distribution Network Projects Laying of Gas Transmission Pipeline from Tuas West Ave to Upper Jurong Road Laying and Commissioning of Gas Transmission Pipeline from Jalan Bahar to Old Choa Chu Kang Road Term Contract for Gas Transmission Pipelines and Facilities Project Works Construction & Maintenance of Roads & Airfield Pavement Planned Maintenance of Expressways, Road Related Facilities and Road Structures Planned Maintenance of Roads in Central/South East/North East Sector Resurfacing of Taxiways at Singapore Changi Airport Construction of New 900 Series Aircraft Parking Stands at Singapore Changi Airport Strengthening of Taxiways Base Proposed Resurfacing Works at Sentosa Gateway Our Customers Our customers include the statutory boards of the Singapore Government and reputable companies: Public Utilities Board (PUB) Land Transport Authority (LTA) Housing and Development Board (HDB) Changi Airport Group SP Group Urban Redevelopment Authority (URA) Our Offices & Facilities 🏢 Corporate Head Office No. 3 Sungei Kadut DriveSingapore 729556 🏭 Asphalt Premix Plant No. 3 Sungei Kadut DriveSingapore 729556 ♻️ Construction Waste Recycling Plant 701A Lim Chu Kang RoadSarimbun Recycling ParkSingapore 719457 🌏 Sri Lanka Office RNH House, No 622-BKotte Road, KotteSri Lanka Our Competitive Strengths 📈 Established Track Record A strong reputation built over 23 years for consistent delivery of quality products and services. Customers include LTA, PUB, HDB, URA, BCA, PowerGas, SingTel, Changi Airport Group, and more. 🔄 One-Stop Services Unique in Singapore and the region, able to leverage on existing scalable, low cost integrated business model for improved competitiveness and overseas expansion. 💰 Operational Synergies One of three asphalt premix plant operators in Singapore, enabling cost-savings and operational efficiencies. Own construction waste recycling plant reduces disposal costs. 👥 Experienced Management Extensive network of customers and business contacts with in-depth industry knowledge to anticipate market changes and customers' needs. 🔧 Advanced Technology Greater value-add to customers through use of latest technologies and advanced equipment for better operational efficiency and productivity. 🏆 Multiple Accreditations BCA's L6 contractor in cable/pipe laying and road reinstatement. A1 contractor in civil engineering. Winner of Enterprise 50 Awards and Singapore Corporate Awards. Portable Traffic Light Selling and Rental We have affordable portable traffic lights for selling and rental. Our durable and easy-to-use temporary traffic lights ensure smooth traffic flow and worker safety in any situation. Features: No sharp edges in mounting brackets or panel casing for safety Base painted in alternate orange and black colour as per requirements 200mm lens with 3-color Traffic Light (Red, Amber, Green) 2-digit LED display Manual height adjustment Waterproof Control Box Adjustable timer settings 2-digit 5\" Red LED Counter with buzzer For more information and quote enquiries, please Contact Us Contact Us Address: No. 3 Sungei Kadut Drive Singapore 729556 Phone: +65 6757 0900 Email: enquiry@leychoon.com © 2024 Ley Choon Group Holdings Limited. All Rights Reserved.",
  "word_count": 1127,
  "sections": {
    "overview": "Business Overview Ley Choon Group Holdings Limited (\"Ley Choon\" or the \"Group\") is one of the largest Underground Utilities Infrastructure companies in Singapore focusing on the following two key business segments: 🔧 Underground Utilities Infrastructure Underground Utilities Infrastructure construction and maintenance, sewer pipeline rehabilitation, laying of high voltage transmission power cable and high pressure transmission LNG GAS pipeline. 🛣️ Asphalt Premix, Milling & Paving Works Asphalt pre-mix production, sales and construction waste recycling as well as road and airfield construction and maintenance.",
    "pipes": "Pipes and Roads Since 1990, Ley Choon has undertaken and completed a wide range of Underground Utilities Infrastructure works and repairs for corporations such as: Public Utilities Board (PUB) Jurong Town Corporation (JTC) Land Transport Authority (LTA) And more... In Singapore, underground utilities like water, gas and sewer pipeline works require specific expertise and specialised equipment for work. We are one of the few companies in Singapore that is well equipped with a wide-ranging in-house expertise, specialised equipment and an expansive range of materials in varying sizes and/or pressure specifications to effectively perform such services. Our Services Utility Diversion & Urgent Repairs Pipelines and Cables Underground Water Pipeline Potable/NEWater Pressurized Gas Pipeline 50mm (low pressure) to 600mm (high pressure steel pipes) Sewer Pipeline Trenchless Technology High Voltage Power Cables Up to 66KV (high tension electricity cable) For more information and quote enquiries, please Contact Us",
    "asphalt": "Asphalt Premix, Milling & Paving Works, Road Marking The use of asphalt premix is paramount to the construction and maintenance of the roads and airfields in Singapore. Ley Choon Group also undertakes the business of construction, extension and maintenance services for roads, airfield taxiways and aprons. We have undertaken airfield resurfacing work at Changi Airport and airfield taxiway and aprons construction at Seletar Airport. We also have a dedicated road marking team to meet your road marking needs. 🏭 Our Asphalt Plant As one of only four asphalt premix plant operators in Singapore, the Group's plant is capable of asphaltic production for different premix formulations in accordance to customer's specifications. Production Capacity: Up to 400 metric ton per hour Silo Storage: Up to 1000 metric ton for finished products Sustainability Initiatives 🌱 Asphalt premix plant operates on natural gas (an environmentally-friendly fuel choice) ♻️ The plant incorporates built-in recycling features to recycle milled waste and used asphalt pavement 🏗️ Construction waste recycling plant produces recycled aggregates for re-use as backfilling materials For more information on the type of asphalt premixes, milling and paving works, please Contact Us",
    "projects": "Project Track Record Potable Water / NEWater Mains Supply, Laying & Diversion of 100-1800mm Dia Ductile Iron and/or Steel Watermains for North & West Areas Supply and Laying of Watermains in West Division Watermain Repairs and Other Contract Work for Network Services (West/East) Division Supply and Laying of NEWater and Industrial Watermains Supply and Installation of Water Connection Works Maintenance and Servicing of Installations in Water Supply (Network) Replacement and Network Enhancement of Watermains Term Contract for Maintenance and Repair Works to Water and Hydrant Mains Systems at Singapore Changi Airport Steel Mains / Sewer Pipelines & Rehabilitation Rehabilitation of Selected 10km of Sewer Lines and Condition Assessment of 125km in Colombo Municipal Council Area Supply, Laying and Installation of 900mm Diameter Water Pipeline along Buangkok Green and Sengkang East Road Proposed Twin 1600mm Diameter Pipeline from AYE/Henderson Road to Keppel Road Proposed 2200mm Diameter Pipeline from Murnane Service Reservoir to PIE/Rifle Range Road Rehabilitation of Sewerage Network Phase 5 – CCTV Survey of Sewers (Eastern Region) Power Cables & Gas Pipelines Supply and Installation of 66kV Power Cables, Auxiliary Cables and Accessories Supply and Installation of 230kV Power Cables and 66kV Power Cables Cable Installation, Cable Jointing and Road Reinstatement Works for Distribution Network Projects Laying of Gas Transmission Pipeline from Tuas West Ave to Upper Jurong Road Laying and Commissioning of Gas Transmission Pipeline from Jalan Bahar to Old Choa Chu Kang Road Term Contract for Gas Transmission Pipelines and Facilities Project Works Construction & Maintenance of Roads & Airfield Pavement Planned Maintenance of Expressways, Road Related Facilities and Road Structures Planned Maintenance of Roads in Central/South East/North East Sector Resurfacing of Taxiways at Singapore Changi Airport Construction of New 900 Series Aircraft Parking Stands at Singapore Changi Airport Strengthening of Taxiways Base Proposed Resurfacing Works at Sentosa Gateway",
    "customers": "Our Customers Our customers include the statutory boards of the Singapore Government and reputable companies: Public Utilities Board (PUB) Land Transport Authority (LTA) Housing and Development Board (HDB) Changi Airport Group SP Group Urban Redevelopment Authority (URA)",
    "offices": "Our Offices & Facilities 🏢 Corporate Head Office No. 3 Sungei Kadut DriveSingapore 729556 🏭 Asphalt Premix Plant No. 3 Sungei Kadut DriveSingapore 729556 ♻️ Construction Waste Recycling Plant 701A Lim Chu Kang RoadSarimbun Recycling ParkSingapore 719457 🌏 Sri Lanka Office RNH House, No 622-BKotte Road, KotteSri Lanka",
    "strengths": "Our Competitive Strengths 📈 Established Track Record A strong reputation built over 23 years for consistent delivery of quality products and services. Customers include LTA, PUB, HDB, URA, BCA, PowerGas, SingTel, Changi Airport Group, and more. 🔄 One-Stop Services Unique in Singapore and the region, able to leverage on existing scalable, low cost integrated business model for improved competitiveness and overseas expansion. 💰 Operational Synergies One of three asphalt premix plant operators in Singapore, enabling cost-savings and operational efficiencies. Own construction waste recycling plant reduces disposal costs. 👥 Experienced Management Extensive network of customers and business contacts with in-depth industry knowledge to anticipate market changes and customers' needs. 🔧 Advanced Technology Greater value-add to customers through use of latest technologies and advanced equipment for better operational efficiency and productivity. 🏆 Multiple Accreditations BCA's L6 contractor in cable/pipe laying and road reinstatement. A1 contractor in civil engineering. Winner of Enterprise 50 Awards and Singapore Corporate Awards.",
    "traffic-lights": "Portable Traffic Light Selling and Rental We have affordable portable traffic lights for selling and rental. Our durable and easy-to-use temporary traffic lights ensure smooth traffic flow and worker safety in any situation. Features: No sharp edges in mounting brackets or panel casing for safety Base painted in alternate orange and black colour as per requirements 200mm lens with 3-color Traffic Light (Red, Amber, Green) 2-digit LED display Manual height adjustment Waterproof Control Box Adjustable timer settings 2-digit 5\" Red LED Counter with buzzer For more information and quote enquiries, please Contact Us"
  }
}